def longestSubarray(nums):
    if not nums:
        return 0
    

    inc_len = dec_len = 1
    max_len = 1 
    
    for i in range(1, len(nums)):
        if nums[i] > nums[i - 1]:
            inc_len += 1
            dec_len = 1
        elif nums[i] < nums[i - 1]:
            dec_len += 1
            inc_len = 1  
        else:
            inc_len = dec_len = 1
        max_len = max(max_len, inc_len, dec_len)
    return max_len


# ამ კოდის მიზანი არის ყველაზე გრძელი მკაცრად ზრდადი ან მკაცრად კლებადი ქვედა მასივის სიგრძის მოძიება. ვიყენებ ორ ცვლადს: inc_len (ზრდადი სიგრძე) და dec_len (კლებადი სიგრძე). თითოეულ ელემენტზე ვამოწმებთ, არის თუ არა ის მის წინა რიცხვზე შედარებით დიდი, პატარა თუ იგივე.თუ მიმდინარე ელემენტი უფრო დიდია წინა ელემენტზე, ზრდადი სიგრძე იზრდება, თუ პატარაა, მაშინ კლებადი სიგრძე იზრდება, თუ ორი ელემენტი ერთმანეთის ტოლია, ორივე სიგრძე იწყება 1-ით. ამის მიხედვით კი ვამოწმებ რომელია ყველაზე დიდი სიგრძე რომელსაც შევხვდი.